9/data/attachments/109b9010cbdbde2d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Samantha_whose_Actions_58464_2</nif:username>
            <nif:friendToBeRequested>soap_actions_2389912f-b513-4ae7-9f7e-cee376d51e91</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>